app/Controllers/M/Classes.php

INSERT INTO `submits` (`file`, `user_id`, `assignment_id`) VALUES ('1693055564_cd58f69f5c2f5b4827a2.pdf', 'M_1', '2')
---
    public function create()
    {
        $userId = session('id');
        $validation = $this->validation;
        $validation->setRules($this->rules());
        if (!$validation->withRequest($this->request)->run()) {
            session()->setFlashdata('status', $this->alertErr("File gagal di upload 😱", "Pastikan file yang diupload adalah *.pdf"));
            return redirect()->back();
        }
        $asId = $this->request->getVar('as_id');
        $file = $this->request->getFile('file');
        $fileName = $file->getRandomName();
        $this->SubmitModel->insert([
            'file' => $fileName,
            'user_id' => $userId,
            'assignment_id' => $asId,
        ]);