app/Controllers/Admin/MajorSubject.php

    public function index()
    {
        $prodi = $this->MajorModel->findAll();
        $matkul = $this->SubjectModel->findAll();
---
SELECT *
FROM `majors`
SELECT *
FROM `subjects`