app/Controllers/D/Classes.php

    public function show($classId = null)
    {
        $kelas = $this->ClassModel->kelasDetail($classId);
        $materi = $this->LessonModel->where('class_id', $classId)->findAll();
---
SELECT *
FROM `lessons`
WHERE `class_id` = '1'