app/Controllers/D/Lessons.php

    public function show($id = null)
    {
        $mahasiswa = $this->AssignmentModel->mhs($id);
        $submitter = count($this->SubmitModel->where('assignment_id', $id)->findAll());
---
SELECT *
FROM `submits`
WHERE `assignment_id` = '2'