app/Models/ClassModel.php

SELECT `classes`.`class_id`, `subjects`.`subj_name`, `majors`.`code_name`, `classes`.`std_group`, `subjects`.`code`
FROM `classes`
JOIN `rteaching` ON `rteaching`.`id` = `classes`.`teaching_id`
JOIN `studentgroups` ON `studentgroups`.`code` = `classes`.`std_group`
JOIN `subjects` ON `subjects`.`code` = `rteaching`.`subj_code`
JOIN `majors` ON `studentgroups`.`major_id` = `majors`.`id`
WHERE `teacher_id` = 'D_2'
---
    public function dosenKelas($dosenId)
    {
        return $this->db->table('classes')
            ->select('classes.class_id,subjects.subj_name,majors.code_name,classes.std_group,subjects.code')
            ->where('teacher_id', $dosenId)
            ->join('rteaching', 'rteaching.id = classes.teaching_id')
            ->join('studentgroups', 'studentgroups.code = classes.std_group')
            ->join('subjects', 'subjects.code = rteaching.subj_code')
            ->join('majors', 'studentgroups.major_id = majors.id')
            ->get()->getResultObject();

SELECT *
FROM `classes`
JOIN `rteaching` ON `rteaching`.`id` = `classes`.`teaching_id`
JOIN `studentgroups` ON `studentgroups`.`code` = `classes`.`std_group`
JOIN `subjects` ON `subjects`.`code` = `rteaching`.`subj_code`
JOIN `majors` ON `studentgroups`.`major_id` = `majors`.`id`
WHERE `class_id` = '1'
---
    public function kelasDetail($classId)
    {
        return $this->db->table('classes')
            ->where('class_id', $classId)
            ->join('rteaching', 'rteaching.id = classes.teaching_id')
            ->join('studentgroups', 'studentgroups.code = classes.std_group')
            ->join('subjects', 'subjects.code = rteaching.subj_code')
            ->join('majors', 'studentgroups.major_id = majors.id')
            ->get()->getResultObject()[0];