app/Models/LessonModel.php

SELECT `lessons`.`id`, `lessons`.`title`, `lessons`.`description`, `assignments`.`id` AS `a_lesson_id`, `assignments`.`deadline`
FROM `lessons`
LEFT JOIN `assignments` ON `assignments`.`lesson_id` = `lessons`.`id`
WHERE `class_id` = '1'
ORDER BY `lessons`.`id`
---
    public function tugas($classId)
    {
        return $this->db->table('lessons')
            ->select('lessons.id, lessons.title, lessons.description, assignments.id AS a_lesson_id, assignments.deadline')
            ->orderBy('lessons.id')
            ->where('class_id', $classId)
            ->join('assignments', 'assignments.lesson_id = lessons.id', 'left')
            ->get()->getResultObject();