app/Models/SubmitModel.php

    public function isSubmit($userId, $asId)
    {
        return $this->db->table('submits')
            ->where('user_id', $userId)
            ->where('assignment_id', $asId)
            ->get()->getResultObject();
---
SELECT *
FROM `submits`
WHERE `user_id` = 'M_1'
AND `assignment_id` = '2'

    public function submitted($id, $userId)
    {
        return $this->db->table('submits')
            ->where('assignment_id', $id)
            ->where('user_id', $userId)
            ->get()->getResultObject();
---
SELECT *
FROM `submits`
WHERE `assignment_id` = '2'
AND `user_id` = 'M_1'

    public function getSubmit($asId, $mhsId)
    {
        return $this->db->table('submits')
            ->select('updated_at, file')
            ->where('assignment_id', $asId)
            ->where('user_id', $mhsId)
            ->get()->getRowArray();
---
SELECT `updated_at`, `file`
FROM `submits`
WHERE `assignment_id` = '2'
AND `user_id` = 'M_1'