app/Models/UserModel.php

SELECT *
FROM `users`
JOIN `teachers` ON `teachers`.`id`=`users`.`user_id`
WHERE `role` = 'dosen'
---
    public function dosen()
    {
        return $this->db->table('users')
            ->where('role', 'dosen')
            ->join('teachers', 'teachers.id=users.user_id')
            ->get()->getResultObject();

SELECT *
FROM `users`
JOIN `students` ON `students`.`id`=`users`.`user_id`
WHERE `role` = 'mahasiswa'
---
    public function mahasiswa()
    {
        return $this->db->table('users')
            ->where('role', 'mahasiswa')
            ->join('students', 'students.id=users.user_id')
            ->get()->getResultObject();

SELECT *
FROM `users`
WHERE `email` = 'toto@amikom.ac.id'
AND `role` = 'admin'
 LIMIT 1
---
    public function getAdmin($userInput)
    {
        return $this->where(['email' => $userInput, 'role' => 'admin'])->asObject()->first();

SELECT *
FROM `users`
WHERE `email` = 'toto@amikom.ac.id'
AND `role` = 'dosen'
 LIMIT 1
---
    public function getDosen($userInput)
    {
        return $this->where(['email' => $userInput, 'role' => 'dosen'])->asObject()->first();

SELECT *
FROM `users`
WHERE `email` = 'toto@amikom.ac.id'
AND `role` = 'mahasiswa'
 LIMIT 1
---
    public function getMahasiswa($userInput)
    {
        return $this->where(['email' => $userInput, 'role' => 'mahasiswa'])->asObject()->first();